; domain
(define (domain zeno-travel)
(:requirements :typing :fluents)
(:types aircraft person city - object)
(:predicates (at ?x - (either person aircraft) ?c - city)
             (in ?p - person ?a - aircraft))
(:functions (fuel ?a - aircraft)
            (distance ?c1 - city ?c2 - city)
            (slow-burn ?a - aircraft)
            (fast-burn ?a - aircraft)
            (capacity ?a - aircraft)
            (total-fuel-used)
	    (onboard ?a - aircraft)
            (zoom-limit ?a - aircraft)
            )


(:action board
 :parameters (?p - person ?a - aircraft ?c - city)
 :precondition (and (at ?p ?c)
                 (at ?a ?c))
 :effect (and (not (at ?p ?c))
              (in ?p ?a)
		(increase (onboard ?a) 1)))


(:action debark
 :parameters (?p - person ?a - aircraft ?c - city)
 :precondition (and (in ?p ?a)
                 (at ?a ?c))
 :effect (and (not (in ?p ?a))
              (at ?p ?c)
		(decrease (onboard ?a) 1)))

(:action fly 
 :parameters (?a - aircraft ?c1 ?c2 - city)
 :precondition (and (at ?a ?c1)
                 (>= (fuel ?a) 
                         (* (distance ?c1 ?c2) (slow-burn ?a))))
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (increase (total-fuel-used)
                         (* (distance ?c1 ?c2) (slow-burn ?a)))
              (decrease (fuel ?a) 
                         (* (distance ?c1 ?c2) (slow-burn ?a)))))
                                  
(:action zoom
 :parameters (?a - aircraft ?c1 ?c2 - city)
 :precondition (and (at ?a ?c1)
                 (>= (fuel ?a) 
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
                 (<= (onboard ?a) (zoom-limit ?a)))
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (increase (total-fuel-used)
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
              (decrease (fuel ?a) 
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
	)
) 

(:action refuel	
 :parameters (?a - aircraft ?c - city)
 :precondition (and (> (capacity ?a) (fuel ?a))
               (at ?a ?c)
		)
 :effect (and (assign (fuel ?a) (capacity ?a)))
)


)

; problem
(define (problem ZTRAVEL-1-6)
(:domain zeno-travel)
(:objects
	plane1 - aircraft
	person1 - person
	person2 - person
	person3 - person
	person4 - person
	person5 - person
	person6 - person
	city0 - city
	city1 - city
	city2 - city
	city3 - city
	city4 - city
	city5 - city
	)
(:init
	(at plane1 city1)
	(= (capacity plane1) 2672)
	(= (fuel plane1) 557)
	(= (slow-burn plane1) 1)
	(= (fast-burn plane1) 2)
	(= (onboard plane1) 0)
	(= (zoom-limit plane1) 4)
	(at person1 city4)
	(at person2 city5)
	(at person3 city3)
	(at person4 city2)
	(at person5 city2)
	(at person6 city0)
	(= (distance city0 city0) 0)
	(= (distance city0 city1) 715)
	(= (distance city0 city2) 847)
	(= (distance city0 city3) 790)
	(= (distance city0 city4) 970)
	(= (distance city0 city5) 912)
	(= (distance city1 city0) 715)
	(= (distance city1 city1) 0)
	(= (distance city1 city2) 596)
	(= (distance city1 city3) 563)
	(= (distance city1 city4) 988)
	(= (distance city1 city5) 646)
	(= (distance city2 city0) 847)
	(= (distance city2 city1) 596)
	(= (distance city2 city2) 0)
	(= (distance city2 city3) 783)
	(= (distance city2 city4) 848)
	(= (distance city2 city5) 542)
	(= (distance city3 city0) 790)
	(= (distance city3 city1) 563)
	(= (distance city3 city2) 783)
	(= (distance city3 city3) 0)
	(= (distance city3 city4) 628)
	(= (distance city3 city5) 994)
	(= (distance city4 city0) 970)
	(= (distance city4 city1) 988)
	(= (distance city4 city2) 848)
	(= (distance city4 city3) 628)
	(= (distance city4 city4) 0)
	(= (distance city4 city5) 897)
	(= (distance city5 city0) 912)
	(= (distance city5 city1) 646)
	(= (distance city5 city2) 542)
	(= (distance city5 city3) 994)
	(= (distance city5 city4) 897)
	(= (distance city5 city5) 0)
	(= (total-fuel-used) 0)
)
(:goal (and
	(at plane1 city3)
	(at person1 city3)
	(at person2 city5)
	(at person3 city3)
	(at person4 city4)
	(at person5 city0)
	(at person6 city0)
	))

(:metric minimize (+ (* 5 (total-time))  (* 1 (total-fuel-used))))
)

; plan
1. (refuel plane1 city1)
   changed: (fuel plane1) from 557 to 2672
   goals met: 3 of 7
2. (fly plane1 city1 city2)
   deleted: (at plane1 city1)
   added: (at plane1 city2)
   changed: (total-fuel-used) from 0 to 596, (fuel plane1) from 2672 to 2076
   goals met: 3 of 7
3. (board person4 plane1 city2)
   deleted: (at person4 city2)
   added: (in person4 plane1)
   changed: (onboard plane1) from 0 to 1
   goals met: 3 of 7
4. (board person5 plane1 city2)
   deleted: (at person5 city2)
   added: (in person5 plane1)
   changed: (onboard plane1) from 1 to 2
   goals met: 3 of 7
5. (fly plane1 city2 city4)
   deleted: (at plane1 city2)
   added: (at plane1 city4)
   changed: (total-fuel-used) from 596 to 1444, (fuel plane1) from 2076 to 1228
   goals met: 3 of 7
6. (debark person4 plane1 city4)
   deleted: (in person4 plane1)
   added: (at person4 city4)
   changed: (onboard plane1) from 2 to 1
   goals met: 4 of 7
7. (board person1 plane1 city4)
   deleted: (at person1 city4)
   added: (in person1 plane1)
   changed: (onboard plane1) from 1 to 2
   goals met: 4 of 7
8. (fly plane1 city4 city3)
   deleted: (at plane1 city4)
   added: (at plane1 city3)
   changed: (total-fuel-used) from 1444 to 2072, (fuel plane1) from 1228 to 600
   goals met: 5 of 7
9. (debark person1 plane1 city3)
   deleted: (in person1 plane1)
   added: (at person1 city3)
   changed: (onboard plane1) from 2 to 1
   goals met: 6 of 7
10. (refuel plane1 city3)
   changed: (fuel plane1) from 600 to 2672
   goals met: 6 of 7
11. (zoom plane1 city3 city0)
   deleted: (at plane1 city3)
   added: (at plane1 city0)
   changed: (total-fuel-used) from 2072 to 3652, (fuel plane1) from 2672 to 1092
   goals met: 5 of 7
12. (debark person5 plane1 city0)
   deleted: (in person5 plane1)
   added: (at person5 city0)
   changed: (onboard plane1) from 1 to 0
   goals met: 6 of 7
13. (fly plane1 city0 city3)
   deleted: (at plane1 city0)
   added: (at plane1 city3)
   changed: (total-fuel-used) from 3652 to 4442, (fuel plane1) from 1092 to 302
   goals met: 7 of 7
